# FamilyDoesntMatchSystemPropertiesWasDisconnected Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..SystemsFailures..::..FamilyDoesntMatchSystemPropertiesWasDisconnected Property
BuiltInFailures..::..SystemsFailures Class See Also
---
The family no longer matches the properties for the System. Disconnect the family from the System?
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId FamilyDoesntMatchSystemPropertiesWasDisconnected { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property FamilyDoesntMatchSystemPropertiesWasDisconnected As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ FamilyDoesntMatchSystemPropertiesWasDisconnected {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..SystemsFailures Class
Autodesk.Revit.DB Namespace